### Codio Activity 4.1: Basic Joins on Datasets

**Expected Time: 60 Minutes**

**Total Points: 10 Points**

This activity focuses on using the `merge` function to join DataFrame's as seen in Videos 4.1 and 4.2.  Merging DataFrames allows the combination of data along a shared categorical column.  The DataFrames do not need to be the same shape and depending on certain arguments used, the result of a merge can contain different values.  Specifically, using different kinds of joins -- `inner, outer, left, right`, different DataFrames are produced.  

## Index:

- [Problem 1](#Problem-1)
- [Problem 2](#Problem-2)
- [Problem 3](#Problem-3)
- [Problem 4](#Problem-4)
- [Problem 5](#Problem-5)

In [46]:
import pandas as pd

### The Data: Antarctic Weather Stations

The dataset for this activity is four `.csv` files.  The file names and descriptions of the data are as follows:

- `person.csv`: people who took readings.
- `site.csv`: locations where readings were taken.
- `visited.csv`: when readings were taken at specific sites.
- `survey.csv`: the actual readings. The field quant is short for quantity and indicates what is being measured. Values are rad, sal, and temp referring to ‘radiation’, ‘salinity’ and ‘temperature’, respectively.

Each dataset is loaded below, and basic info displayed.

In [47]:
site = pd.read_csv('data/site.csv')

In [48]:
site.head(2)

   name    lat    long
0  DR-1 -49.85 -128.57
1  DR-3 -47.15 -126.72

In [49]:
site.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   lat     3 non-null      float64
 2   long    3 non-null      float64
dtypes: float64(2), object(1)
memory usage: 200.0+ bytes

In [50]:
visited = pd.read_csv('data/visited.csv')

In [51]:
visited.head(2)

    id  site       dated
0  619  DR-1  1927-02-08
1  622  DR-1  1927-02-10

In [52]:
visited.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      8 non-null      int64
 1   site    8 non-null      object
 2   dated   7 non-null      object
dtypes: int64(1), object(2)
memory usage: 320.0+ bytes

In [53]:
person = pd.read_csv('data/person.csv')
person.head(2)

     id personal   family
0  dyer  William     Dyer
1    pb    Frank  Pabodie

In [54]:
survey = pd.read_csv('data/survey.csv')
survey.head(2)

   taken person quant  reading
0    619   dyer   rad     9.82
1    619   dyer   sal     0.13

In [55]:
survey.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21 entries, 0 to 20
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   taken    21 non-null     int64
 1   person   19 non-null     object
 2   quant    21 non-null     object
 3   reading  21 non-null     float64
dtypes: float64(1), int64(1), object(2)
memory usage: 800.0+ bytes

[Back to top](#Index:) 

### Problem 1

#### Merging site and visited

**5 Points**

Note that in the site data the name column is the same information as in the visited `site` column.  Use  `pd.merge` to merge the site with the visited based on the shared column.  Use `site` as your left DataFrame and `visited` as your right.  Assign your result as a DataFrame to `site_visits_df` below.

In [56]:
### GRADED

site_visits_df = pd.merge(left=site, right=visited, left_on="name", right_on="site", how="outer")

# Answer check
print(type(site_visits_df), site_visits_df.shape)
site_visits_df.head()

<class 'pandas.core.frame.DataFrame'> (8, 6)

   name    lat    long   id  site       dated
0  DR-1 -49.85 -128.57  619  DR-1  1927-02-08
1  DR-1 -49.85 -128.57  622  DR-1  1927-02-10
2  DR-1 -49.85 -128.57  844  DR-1  1932-03-22
3  DR-3 -47.15 -126.72  734  DR-3  1930-01-07
4  DR-3 -47.15 -126.72  735  DR-3  1930-01-12

[Back to top](#Index:) 

### Problem 2

#### Revisit with shared Column Name

**5 Points**


Now, before merging the data rename the `visited` data column `site` to `name`, and merge using the `on` argument to specify the shared column name.  Assign the renamed data to `visited_renamed` below, and the result of the merge to `site_visits_df2` below.  Note that your solution should have one column fewer than the solution to problem 1.

In [57]:
### GRADED

visited_renamed = visited.rename(columns={"site":"name"})
site_visits_df2 = pd.merge(left=site, right=visited_renamed, on="name", how="outer")

# Answer check
print(site_visits_df2.shape)
site_visits_df2.head()

(8, 5)

   name    lat    long   id       dated
0  DR-1 -49.85 -128.57  619  1927-02-08
1  DR-1 -49.85 -128.57  622  1927-02-10
2  DR-1 -49.85 -128.57  844  1932-03-22
3  DR-3 -47.15 -126.72  734  1930-01-07
4  DR-3 -47.15 -126.72  735  1930-01-12

[Back to top](#Index:) 

### Problem 3

#### Merging the Survey Results

**5 Points**

The effect of merging the `site` and `visited` is that a DataFrame with each sites name, location, visit id, and date has been created. 

To include the data collected at each site in these visits, the survey data needs to be consulted.  

Identify the shared column in the `site_visits_df2` data and the `survey` data, and merge the data based on this column.  

Rename the column in the `survey` frame appropriately so as to not have a reduntant column in the data and assign your merged DataFrame to `survey_site_visits` below.

In [58]:
site_visits_df2.head(2)

   name    lat    long   id       dated
0  DR-1 -49.85 -128.57  619  1927-02-08
1  DR-1 -49.85 -128.57  622  1927-02-10

In [59]:
survey.head(2)

   taken person quant  reading
0    619   dyer   rad     9.82
1    619   dyer   sal     0.13

In [60]:
### GRADED
survey_site_visits = pd.merge(left=survey.rename(columns={"taken":"id"}), right=site_visits_df2, on="id", how="outer")

# Answer check
print(type(survey_site_visits))
display(survey_site_visits.head(5))

<class 'pandas.core.frame.DataFrame'>

    id person quant  reading  name    lat    long       dated
0  619   dyer   rad     9.82  DR-1 -49.85 -128.57  1927-02-08
1  619   dyer   sal     0.13  DR-1 -49.85 -128.57  1927-02-08
2  622   dyer   rad     7.80  DR-1 -49.85 -128.57  1927-02-10
3  622   dyer   sal     0.09  DR-1 -49.85 -128.57  1927-02-10
4  734     pb   rad     8.41  DR-3 -47.15 -126.72  1930-01-07

[Back to top](#Index:) 

### Problem 4

### Adding Full Names

**5 Points**

Finally, use the `survey_site_visits` dataframe together with the `person` data to create a single DataFrame that includes the personal and family name columns in each observation.  Rename the shared column in both to `person_id` and join on this with `survey_site_visits` acting as your left DataFrame.  Assign your results to `full_name_df` below.

In [61]:
### GRADED
full_name_df = pd.merge(
    left=survey_site_visits.rename(columns={"person":"person_id"}),
    right=person.rename(columns={"id":"person_id"}),
    on="person_id", how="inner")

# Answer check
print(type(full_name_df))
full_name_df.head(5)

<class 'pandas.core.frame.DataFrame'>

,id,person_id,quant,reading,name,lat,long,dated,personal,family
0,619,dyer,rad,9.82,DR-1,-49.85,-128.57,1927-02-08,William,Dyer
1,619,dyer,sal,0.13,DR-1,-49.85,-128.57,1927-02-08,William,Dyer
2,622,dyer,rad,7.80,DR-1,-49.85,-128.57,1927-02-10,William,Dyer
3,622,dyer,sal,0.09,DR-1,-49.85,-128.57,1927-02-10,William,Dyer
4,734,pb,rad,8.41,DR-3,-47.15,-126.72,1930-01-07,Frank,Pabodie

In [62]:
site_ = pd.read_csv('data/site.csv')
visit_ = pd.read_csv('data/visited.csv')
person_ = pd.read_csv('data/person.csv')
survey_ = pd.read_csv('data/survey.csv')
visited_renamed_ = visit_.rename({'site': 'name'}, axis = 1)
site_visits_df2_ = pd.merge(site_, visited_renamed_, on = 'name')
survey_site_visits_ = pd.merge(survey_.rename({'taken': 'id'}, axis = 1), 
                              site_visits_df2_, on = 'id')
left_ = survey_site_visits_.rename({'person': 'person_id'}, axis = 1)
right_ = person_.rename({'id': 'person_id'}, axis = 1)
full_name_df_ = pd.merge(left_, right_, on = 'person_id')

display(full_name_df.head(5))
display(full_name_df_.head(5))

pd.testing.assert_frame_equal(full_name_df, full_name_df_)

,id,person_id,quant,reading,name,lat,long,dated,personal,family
0,619,dyer,rad,9.82,DR-1,-49.85,-128.57,1927-02-08,William,Dyer
1,619,dyer,sal,0.13,DR-1,-49.85,-128.57,1927-02-08,William,Dyer
2,622,dyer,rad,7.80,DR-1,-49.85,-128.57,1927-02-10,William,Dyer
3,622,dyer,sal,0.09,DR-1,-49.85,-128.57,1927-02-10,William,Dyer
4,734,pb,rad,8.41,DR-3,-47.15,-126.72,1930-01-07,Frank,Pabodie

,id,person_id,quant,reading,name,lat,long,dated,personal,family
0,619,dyer,rad,9.82,DR-1,-49.85,-128.57,1927-02-08,William,Dyer
1,619,dyer,sal,0.13,DR-1,-49.85,-128.57,1927-02-08,William,Dyer
2,622,dyer,rad,7.80,DR-1,-49.85,-128.57,1927-02-10,William,Dyer
3,622,dyer,sal,0.09,DR-1,-49.85,-128.57,1927-02-10,William,Dyer
4,734,pb,rad,8.41,DR-3,-47.15,-126.72,1930-01-07,Frank,Pabodie

[Back to top](#Index:) 

### Problem 5

#### `left` vs. `right` merge

**5 Points**

Below two new DataFrames -- `df1` and `df2` -- are created with the shared column `name`.  Note the different unique values in the `name` column in each.  Use `pd.merge` and choose the appropriate argument for `how` as either `left` or `right` to create the following table:

<table border="1" class="dataframe">  <thead>    <tr style="text-align: right;">      <th></th>      <th>name</th>      <th>age</th>      <th>member</th>    </tr>  </thead>  <tbody>    <tr>      <th>0</th>      <td>amy</td>      <td>32</td>      <td>True</td>    </tr>    <tr>      <th>1</th>      <td>ben</td>      <td>30</td>      <td>NaN</td>    </tr>    <tr>      <th>2</th>      <td>carlos</td>      <td>40</td>      <td>True</td>    </tr>  </tbody></table>

Assign your results to `ans5` below.

In [63]:
df1 = pd.DataFrame({'name': ['amy', 'ben', 'carlos'],
                   'age': [32, 30, 40]})
df2 = pd.DataFrame({'name': ['amy', 'carlos', 'lenny'],
                   'member': [True, True, False]})

In [64]:
### GRADED
ans5 = pd.merge(left=df1, right=df2, on="name", how="left")

# Answer check
print(type(ans5))
display(ans5.head())

<class 'pandas.core.frame.DataFrame'>

     name  age member
0     amy   32   True
1     ben   30    NaN
2  carlos   40   True